# 4. Напишіть програму, у якій користувач вводить п'ять чисел одне за одним.
# Після кожного введення перевіряйте, чи число більше за введені раніше.
# Якщо користувач ввів менше число за введені раніше - поверніться
# до введення першого числа завдяки goto.
# В кінці виведіть найбільше введене число.

while True:
    numbers = []
    restart = False

    for i in range(5):
        num = int(input(f"Введіть число {i+1}: "))

        if i > 0 and num <= max(numbers):
            print("Ви ввели число, яке не більше за попередні.")
            print("Повернення до введення першого числа...")
            restart = True
            break

        numbers.append(num)

    if restart:
        continue

    print("Найбільше введене число:", max(numbers))
    break