s = 0                                         # Змінна для накопичення суми

while True:                                      # Безкінечний цикл, поки не зустрінеться непарне число
    n = int(input("Введіть число: "))           # Зчитуємо число з клавіатури
    if n % 2 == 0:                              # Перевіряємо, чи число парне
        s += n                             # Якщо парне — додаємо до суми
    else:                                        # Інакше (непарне)
        break                                    # Завершуємо цикл

print("Сума всіх введених парних чисел =", s)  # Виводимо суму парних чисел
