
#Приклад 1. Перевірка числа на парність
number = int(input("Введіть число: "))
if number % 2 == 0:
    print("Число парне")
else:
    print("Число непарне")

#Приклад 2. Порівняння двох чисел
a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))

if a > b:
    print("Перше число більше")
elif a < b:
    print("Друге число більше")
else:
    print("Числа рівні")

#Приклад 3. Обчислення оцінки за балами
score = int(input("Введіть кількість балів: "))

if score >= 90:
    print("Оцінка: Відмінно")
elif score >= 75:
    print("Оцінка: Добре")
elif score >= 60:
    print("Оцінка: Задовільно")
else:
    print("Оцінка: Незадовільно")


