
#У Python немає конструкції switch як у C#
#Але надам для перевірки подібну конструкцію за допомогою словників або if-elif-else конструкцій

#конструкції if-elif-else
def визначити_локацію(x, y):
    if x == 10 and y == 20:
        print("персонаж попав у місто")
    elif x == -25 and y == 10:
        print("персонаж попав у ліс")
    elif x == -50 and y == 3:
        print("персонаж попав у місто")
    elif x == 70 and y == 65:
        print("персонаж попав в печеру")
    else:
        print("невідома локація")

# Перевірка

визначити_локацію(10, 20)
визначити_локацію(-25, 10)
визначити_локацію(-50, 3)
визначити_локацію(70, 65)
визначити_локацію(730, 99)   #невідома локація

#####################################################################


#Словник кортежі

def визначити_локацію2(x, y):
    координати_локацій = {
        (10, 20): "персонаж попав у місто",
        (-25, 10): "персонаж попав у ліс",
        (-50, 3): "персонаж попав у місто",
        (70, 65): "персонаж попав в печеру"
    }

    повідомлення = координати_локацій.get((x, y), "невідома локація")
    print(повідомлення)

# Перевірка
визначити_локацію2(10, 20)
визначити_локацію2(-25, 10)
визначити_локацію2(-50, 3)
визначити_локацію2(70, 65)
визначити_локацію(730, 99)   #невідома локація